[
	{
		"id": "Magical Tinkering",
		"name": "Magical Tinkering",
		"level": 1,
		"description": "You've learned how to invest a spark of magic into mundane objects. To use this ability, you must have thieves' tools or artisan's tools in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:",
		"requirements": [
			"Thieves' tools or artisan's tools in hand",
			"Tiny nonmagical object",
			"Action to apply or end property"
		],
		"properties": [
			{
				"Light": "The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet."
			},
			{
				"Recorded Message": "Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long."
			},
			{
				"Continuous Effect": "The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away."
			},
			{
				"Visual Effect": "A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like."
			}
		],
		"limitations": [
			"A single object can only bear one property at a time",
			"Maximum number of affected objects equals Intelligence modifier (minimum 1)",
			"Exceeding maximum causes oldest property to end"
		],
		"duration": "Indefinite until ended as an action"
	},
	{
		"id": "Spellcasting",
		"name": "Spellcasting",
		"level": 1,
		"description": "You've studied the workings of magic and how to cast spells, channeling the magic through objects. To observers, you don't appear to be casting spells in a conventional way; you appear to produce wonders from mundane items and outlandish inventions.",
		"requirements": [
			"Must use tools or an infused item as a spellcasting focus",
			"Can use artisan's tools as spellcasting focus"
		]
	},
	{
		"id": "Infuse Item",
		"name": "Infuse Item",
		"level": 2,
		"description": "You've gained the ability to imbue mundane items with certain magical infusions, turning those objects into magic items.",
		"features": [
			{
				"Infusions Known": "When you gain this feature, pick four artificer infusions to learn. You learn additional infusions of your choice when you reach certain levels in this class, as shown in the Infusions Known column of the Artificer table. Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one."
			},
			{
				"Infusing an Item": "Whenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement."
			}
		],
		"limitations": [
			"Each infusion can be in only one object at a time",
			"No object can bear more than one of your infusions at a time",
			"Maximum number of infused items shown in Artificer table",
			"Exceeding maximum causes oldest infusion to end"
		],
		"duration": {
			"infusion": "Indefinite until you die or replace the infusion",
			"after death": "Number of days equal to Intelligence modifier (minimum 1)"
		},
		"special": "If an infusion ends on an item that contains other things, like a bag of holding, its contents harmlessly appear in and around its space."
	},
	{
		"id": "Artificer Specialist",
		"name": "Artificer Specialist",
		"level": 3,
		"description": "You choose the type of specialist you are. Your choice grants you features at 5th level and again at 9th and 15th level.",
		"specialties": ["Alchemist", "Armorer", "Artillerist", "Battle Smith"]
	},
	{
		"id": "The Right Tool for the Job",
		"name": "The Right Tool for the Job",
		"level": 3,
		"description": "You've learned how to produce exactly the tool you need: with thieves' tools or artisan's tools in hand, you can magically create one set of artisan's tools in an unoccupied space within 5 feet of you.",
		"requirements": [
			"Must have thieves' tools or artisan's tools in hand",
			"Requires 1 hour of uninterrupted work",
			"Can coincide with a short or long rest"
		],
		"features": [
			"Creates one set of artisan's tools",
			"Tools are nonmagical",
			"Tools vanish when feature is used again"
		]
	},
	{
		"id": "Tool Expertise",
		"name": "Tool Expertise",
		"level": 6,
		"description": "Your proficiency bonus is now doubled for any ability check you make that uses your proficiency with a tool."
	},
	{
		"id": "Flash of Genius",
		"name": "Flash of Genius",
		"level": 7,
		"description": "You've gained the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll.",
		"mechanics": {
			"trigger": {
				"condition": "When you or another creature within 30 feet makes an ability check or saving throw",
				"cost": "reaction"
			},
			"effect": "Add Intelligence modifier to the roll",
			"uses": {
				"amount": "Intelligence modifier (minimum 1)",
				"reset": "long rest"
			},
			"range": "30 feet"
		}
	},
	{
		"id": "Magic Item Adept",
		"name": "Magic Item Adept",
		"level": 10,
		"description": "You achieve a profound understanding of how to use and make magic items.",
		"features": [
			"Can attune to up to 4 magic items at once",
			"Crafting common/uncommon magic items takes 1/4 normal time and 1/2 normal gold cost"
		]
	},
	{
		"id": "Spell-Storing Item",
		"name": "Spell-Storing Item",
		"level": 11,
		"description": "You can store a spell in an object. After a long rest, touch one simple/martial weapon or spellcasting focus to store a spell in it.",
		"mechanics": {
			"spell requirements": {
				"level": "1st or 2nd level",
				"casting time": "1 action",
				"source": "artificer spell list"
			},
			"usage": {
				"action": "Creature holding object can use action to cast stored spell",
				"spellcasting": "Uses your spellcasting ability modifier",
				"concentration": "Required if spell normally requires it"
			},
			"duration": {
				"uses": "Twice your Intelligence modifier (minimum of twice)",
				"ends": "When uses depleted or feature used again"
			}
		}
	},
	{
		"id": "Magic Item Savant",
		"name": "Magic Item Savant",
		"level": 14,
		"description": "Your skill with magic items deepens more.",
		"features": [
			"Can attune to up to 5 magic items at once",
			"Ignore all class, race, spell and level requirements for magic item attunement and use"
		]
	},
	{
		"id": "Magic Item Master",
		"name": "Magic Item Master",
		"level": 18,
		"description": "You can attune to up to six magic items at once."
	},
	{
		"id": "Soul of Artifice",
		"name": "Soul of Artifice",
		"level": 20,
		"description": "You develop a mystical connection to your magic items, which you can draw on for protection.",
		"features": [
			"+1 bonus to all saving throws per magic item you are currently attuned to"
		],
		"mechanics": {
			"survival": {
				"trigger": "Reduced to 0 hit points but not killed outright",
				"effect": "Drop to 1 hit point instead",
				"cost": "Reaction and end one artificer infusion"
			}
		}
	}
]
