{
	"draconic-disciple": {
		"level": 3,
		"description": "You can channel draconic power to magnify your presence and imbue your unarmed strikes with the essence of a dragon's breath.",
		"benefits": {
			"draconic-presence": "If you fail a Charisma (Intimidation) or Charisma (Persuasion) check, you can use your reaction to reroll the check, as you tap into the mighty presence of dragons. Once this feature turns a failure into a success, you can't use it again until you finish a long rest.",
			"draconic-strike": "When you damage a target with an unarmed strike, you can change the damage type to acid, cold, fire, lightning, or poison.",
			"tongue-of-dragons": "You learn to speak, read, and write Draconic or one other language of your choice."
		}
	},
	"breath-of-the-dragon": {
		"level": 3,
		"description": "When you take the Attack action on your turn, you can replace one of the attacks with an exhalation of draconic energy in either a 20-foot cone or a 30-foot line that is 5 feet wide (your choice). Choose a damage type: acid, cold, fire, lightning, or poison. Each creature in that area must make a Dexterity saving throw against your ki save DC, taking damage of the chosen type equal to two rolls of your Martial Arts die on a failed save, or half as much damage on a successful one.",
		"additionalDetails": [
			"At 11th level, the damage of this feature increases to three rolls of your Martial Arts die.",
			"You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. While you have no uses available, you can spend 2 ki points to use this feature again."
		]
	},
	"wings-unfurled": {
		"level": 6,
		"description": "When you use your Step of the Wind, you can unfurl spectral draconic wings from your back that vanish at the end of your turn. While the wings exist, you have a flying speed equal to your walking speed.",
		"uses": "You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
	},
	"aspect-of-the-wyrm": {
		"level": 11,
		"description": "As a bonus action, you can create an aura of draconic power that radiates 10 feet from you for 1 minute. For the duration, you gain one of the following effects of your choice:",
		"effects": {
			"frightful-presence": "When you create this aura, and as a bonus action on subsequent turns, you can choose a creature within the aura. The target must succeed on a Wisdom saving throw against your ki save DC or become frightened of you for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a successful save.",
			"resistance": "Choose a damage type when you activate this aura: acid, cold, fire, lightning, or poison. You and your allies within the aura have resistance to that damage."
		},
		"uses": "Once you create this aura, you can't create it again until you finish a long rest, unless you expend 3 ki points to create it again."
	},
	"ascendant-aspect": {
		"level": 17,
		"description": "Your draconic spirit reaches its peak. You gain the following benefits:",
		"benefits": {
			"augment-breath": "When you use your Breath of the Dragon, you can spend 1 ki point to augment its shape and power. The exhalation of draconic energy becomes either a 60-foot cone or a 90-foot line that is 5 feet wide (your choice), and each creature in that area takes damage equal to four rolls of your Martial Arts die on a failed save, or half as much damage on a successful one.",
			"blindsight": "You gain blindsight out to 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness. Moreover, you can see an invisible creature within that range, unless the creature successfully hides from you.",
			"explosive-fury": "When you activate your Aspect of the Wyrm, draconic fury explodes from you. Choose any number of creatures you can see in your aura. Each of those creatures must succeed on a Dexterity saving throw against your ki save DC or take 3d10 acid, cold, fire, lightning, or poison damage (your choice)."
		}
	}
}
