{
	"implementsOfMercy": {
		"level": 3,
		"description": "When you choose this tradition at 3rd level, you gain proficiency in the Insight and Medicine skills, and you gain proficiency with the herbalism kit.",
		"mask": {
			"description": "You also gain a special mask, which you often wear when using the features of this subclass. You determine its appearance, or generate it randomly by rolling on the Merciful Mask table.",
			"table": {
				"1": "Raven",
				"2": "Blank and white",
				"3": "Crying visage",
				"4": "Laughing visage",
				"5": "Skull",
				"6": "Butterfly"
			}
		}
	},
	"handsOfHealing": {
		"level": 3,
		"description": "Your mystical touch can mend wounds. As an action, you can spend 1 ki point to touch a creature and restore a number of hit points equal to a roll of your Martial Arts die + your Wisdom modifier.",
		"flurryEffect": "When you use your Flurry of Blows, you can replace one of the unarmed strikes with a use of this feature without spending a ki point for the healing."
	},
	"handsOfHarm": {
		"level": 3,
		"description": "You use your ki to inflict wounds. When you hit a creature with an unarmed strike, you can spend 1 ki point to deal extra necrotic damage equal to one roll of your Martial Arts die + your Wisdom modifier. You can use this feature only once per turn."
	},
	"physiciansTouch": {
		"level": 6,
		"description": "You can administer even greater cures with a touch, and if you feel it's necessary, you can use your knowledge to cause harm.",
		"healing": "When you use Hands of Healing on a creature, you can also end one disease or one of the following conditions affecting the creature: blinded, deafened, paralyzed, poisoned, or stunned.",
		"harm": "When you use Hands of Harm on a creature, you can subject that creature to the poisoned condition until the end of your next turn."
	},
	"flurryOfHealingAndHarm": {
		"level": 11,
		"description": "You can now mete out a flurry of comfort and hurt. When you use Flurry of Blows, you can now replace each of the unarmed strikes with a use of your Hands of Healing, without spending ki points for the healing.",
		"additionalEffect": "In addition, when you make an unarmed strike with Flurry of Blows, you can use Hand of Harm with that strike without spending the ki point for Hands of Harm. You can still use Hands of Harm only once per turn."
	},
	"handOfUltimateMercy": {
		"level": 17,
		"description": "By 17th level, your mastery of life energy opens the door to the ultimate mercy. As an action, you can touch the corpse of a creature that died within the past 24 hours and expend 5 ki points. The creature then returns to life, regaining a number of hit points equal to 4d10 + your Wisdom modifier. If the creature died while subject to any of the following conditions, it revives with them removed: blinded, deafened, paralyzed, poisoned, and stunned.",
		"limitation": "Once you use this feature, you can't use it again until you finish a long rest."
	}
}
