[
	{
		"id": "Unarmored Defense",
		"name": "Unarmored Defense",
		"level": 1,
		"description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.",
		"mechanics": {
			"ac_calculation": "10 + Dexterity modifier + Wisdom modifier",
			"requirements": ["No armor", "No shield"]
		}
	},
	{
		"id": "Martial Arts",
		"name": "Martial Arts",
		"level": 1,
		"description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.\n\nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield:\n\nYou can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\nYou can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\nWhen you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.\nCertain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon on the Weapons page.",
		"mechanics": {
			"monk_weapons": [
				"Shortswords",
				"Simple melee weapons without two-handed or heavy property"
			],
			"requirements": "While unarmed or wielding only monk weapons and not wearing armor/shield",
			"effects": [
				"Can use Dexterity for attack/damage rolls",
				"Martial arts die replaces normal damage",
				"Bonus action unarmed strike after Attack action"
			]
		}
	},
	{
		"id": "Ki",
		"name": "Ki",
		"level": 2,
		"description": "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.\n\nYou can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.\n\nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\n\nSome of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:\n\nKi save DC = 8 + your proficiency bonus + your Wisdom modifier\n\nFlurry of Blows. Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.\nPatient Defense. You can spend 1 ki point to take the Dodge action as a bonus action on your turn.\nStep of the Wind. You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn.",
		"mechanics": {
			"ki_points": "Monk level",
			"reset": "short or long rest",
			"meditation_time": "30 minutes",
			"save_dc": "8 + proficiency bonus + Wisdom modifier",
			"features": [
				{
					"name": "Flurry of Blows",
					"cost": "1 ki point",
					"effect": "Two unarmed strikes as bonus action after Attack action"
				},
				{
					"name": "Patient Defense",
					"cost": "1 ki point",
					"effect": "Dodge action as bonus action"
				},
				{
					"name": "Step of the Wind",
					"cost": "1 ki point",
					"effect": "Disengage or Dash as bonus action, double jump distance"
				}
			]
		}
	},
	{
		"id": "Unarmored Movement",
		"name": "Unarmored Movement",
		"level": 2,
		"description": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
		"mechanics": {
			"speed_bonus": {
				"2-5": "+10 feet",
				"6-9": "+15 feet",
				"10-13": "+20 feet",
				"14-17": "+25 feet",
				"18-20": "+30 feet"
			},
			"requirements": ["No armor", "No shield"],
			"vertical_movement": {
				"level": 9,
				"effect": "Can move along vertical surfaces and across liquids without falling"
			}
		}
	},
	{
		"id": "Dedicated Weapon",
		"name": "Dedicated Weapon",
		"level": 2,
		"description": "Also at 2nd level, you train yourself to use a variety of weapons as monk weapons, not just simple melee weapons and shortswords. Whenever you finish a short or long rest, you can touch one weapon, focus your ki on it, and then count that weapon as a monk weapon until you use this feature again.\n\nThe chosen weapon must meet these criteria:\n\nThe weapon must be a simple or martial weapon.\nYou must be proficient with it.\nIt must lack the heavy and special properties.",
		"optional": true,
		"mechanics": {
			"activation": "After short or long rest",
			"requirements": [
				"Simple or martial weapon",
				"Must be proficient",
				"Cannot have heavy or special properties"
			]
		}
	},
	{
		"id": "Monastic Tradition",
		"name": "Monastic Tradition",
		"level": 3,
		"description": "When you reach 3rd level, you commit yourself to a monastic tradition. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level.",
		"subclass_features": {
			"feature_levels": [3, 6, 11, 17],
			"options": [
				"Astral Self",
				"Ascendant Dragon",
				"Drunken Master",
				"Four Elements",
				"Kensei",
				"Long Death",
				"Mercy",
				"Open Hand",
				"Shadow",
				"Sun Soul"
			]
		}
	},
	{
		"id": "Deflect Missiles",
		"name": "Deflect Missiles",
		"level": 3,
		"description": "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.\n\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with a range of 20/60 using the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack.",
		"mechanics": {
			"action": "reaction",
			"damage_reduction": "1d10 + Dexterity modifier + monk level",
			"catch_requirements": [
				"Reduce damage to 0",
				"Missile must fit in one hand",
				"Must have free hand"
			],
			"return_attack": {
				"cost": "1 ki point",
				"range": "20/60",
				"counts_as": "monk weapon"
			}
		}
	},
	{
		"id": "Ki Fueled Attack",
		"name": "Ki-Fueled Attack",
		"level": 3,
		"description": "Also at 3rd level, if you spend 1 ki point or more as part of your action on your turn, you can make one attack with an unarmed strike or a monk weapon as a bonus action before the end of the turn.",
		"optional": true,
		"mechanics": {
			"trigger": "Spend 1+ ki points as part of action",
			"effect": "One unarmed strike or monk weapon attack as bonus action"
		}
	},
	{
		"id": "Slow Fall",
		"name": "Slow Fall",
		"level": 4,
		"description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
		"mechanics": {
			"action": "reaction",
			"damage_reduction": "5 × monk level"
		}
	},
	{
		"id": "Quickened Healing",
		"name": "Quickened Healing",
		"level": 4,
		"description": "Also at 4th level, as an action, you can spend 2 ki points and roll a Martial Arts die. You regain a number of hit points equal to the number rolled plus your proficiency bonus.",
		"optional": true,
		"mechanics": {
			"action": "action",
			"cost": "2 ki points",
			"healing": "Martial Arts die + proficiency bonus"
		}
	},
	{
		"id": "Extra Attack",
		"name": "Extra Attack",
		"level": 5,
		"description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
		"mechanics": {
			"attacks_per_action": 2
		}
	},
	{
		"id": "Stunning Strike",
		"name": "Stunning Strike",
		"level": 5,
		"description": "Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.",
		"mechanics": {
			"trigger": "Hit with melee weapon attack",
			"cost": "1 ki point",
			"save": "Constitution",
			"effect": "Stunned until end of your next turn"
		}
	},
	{
		"id": "Focused Aim",
		"name": "Focused Aim",
		"level": 5,
		"description": "Also at 5th level, when you miss with an attack roll, you can spend 1 to 3 ki points to increase your attack roll by 2 for each of these ki points you spend, potentially turning the miss into a hit.",
		"optional": true,
		"mechanics": {
			"trigger": "Miss with attack roll",
			"cost": "1-3 ki points",
			"bonus": "+2 per ki point spent"
		}
	},
	{
		"id": "Ki Empowered Strikes",
		"name": "Ki-Empowered Strikes",
		"level": 6,
		"description": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
		"mechanics": {
			"effect": "Unarmed strikes count as magical"
		}
	},
	{
		"id": "Evasion",
		"name": "Evasion",
		"level": 7,
		"description": "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
		"mechanics": {
			"trigger": "Dexterity saving throw for half damage",
			"success": "No damage",
			"failure": "Half damage"
		}
	},
	{
		"id": "Stillness of Mind",
		"name": "Stillness of Mind",
		"level": 7,
		"description": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened.",
		"mechanics": {
			"action": "action",
			"effect": "End charmed or frightened condition"
		}
	},
	{
		"id": "Purity of Body",
		"name": "Purity of Body",
		"level": 10,
		"description": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.",
		"mechanics": {
			"immunities": ["Disease", "Poison"]
		}
	},
	{
		"id": "Tongue of the Sun and Moon",
		"name": "Tongue of the Sun and Moon",
		"level": 13,
		"description": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.",
		"mechanics": {
			"effects": [
				"Understand all spoken languages",
				"Can be understood by any creature that knows a language"
			]
		}
	},
	{
		"id": "Diamond Soul",
		"name": "Diamond Soul",
		"level": 14,
		"description": "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.\n\nAdditionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.",
		"mechanics": {
			"primary": "Proficiency in all saving throws",
			"reroll": {
				"trigger": "Failed saving throw",
				"cost": "1 ki point",
				"effect": "Reroll and take second result"
			}
		}
	},
	{
		"id": "Timeless Body",
		"name": "Timeless Body",
		"level": 15,
		"description": "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
		"mechanics": {
			"effects": [
				"No frailty from old age",
				"Immune to magical aging",
				"No need for food or water"
			]
		}
	},
	{
		"id": "Empty Body",
		"name": "Empty Body",
		"level": 18,
		"description": "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.\n\nAdditionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can't take any other creatures with you.",
		"mechanics": {
			"invisibility": {
				"cost": "4 ki points",
				"action": "action",
				"duration": "1 minute",
				"effect": ["Invisibility", "Resistance to all damage except force"]
			},
			"astral_projection": {
				"cost": "8 ki points",
				"components": "No material components needed",
				"limitation": "Cannot bring other creatures"
			}
		}
	},
	{
		"id": "Perfect Self",
		"name": "Perfect Self",
		"level": 20,
		"description": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points.",
		"mechanics": {
			"trigger": "Roll initiative with 0 ki points",
			"effect": "Regain 4 ki points"
		}
	}
]
