{
	"name": "Glamour",
	"mantleOfInspiration": {
		"level": 3,
		"description": "As a bonus action, you can expend one use of your Bardic Inspiration to grant yourself a wondrous appearance. When you do so, choose a number of creatures you can see and who can see you within 60 feet of you, up to a number equal to your Charisma modifier (minimum of one). Each of them gains 5 temporary hit points. When a creature gains these temporary hit points, it can immediately use its reaction to move up to its speed, without provoking opportunity attacks.",
		"improvements": [
			"5th level: 8 temporary hit points",
			"10th level: 11 temporary hit points",
			"15th level: 14 temporary hit points"
		]
	},
	"enthrallingPerformance": {
		"level": 3,
		"description": "If you perform for at least 1 minute, you can attempt to inspire wonder in your audience by singing, reciting a poem, or dancing. At the end of the performance, choose a number of humanoids within 60 feet of you who watched and listened to all of it, up to a number equal to your Charisma modifier (minimum of one). Each target must succeed on a Wisdom saving throw against your spell save DC or be charmed by you. While charmed in this way, the target idolizes you, it speaks glowingly of you to anyone who speaks to it, and it hinders anyone who opposes you, avoiding violence unless it was already inclined to fight on your behalf.",
		"additionalDetails": [
			"Effect ends after 1 hour, if target takes damage, if you attack it, or if it witnesses you attacking its allies",
			"On successful save, target has no hint you tried to charm it",
			"Once used, can't use again until after a short or long rest"
		]
	},
	"mantleOfMajesty": {
		"level": 6,
		"description": "As a bonus action, you cast Command, without expending a spell slot, and you take on an appearance of unearthly beauty for 1 minute or until your concentration ends (as if you were concentrating on a spell). During this time, you can cast Command as a bonus action on each of your turns, without expending a spell slot.",
		"additionalDetails": [
			"Any creature charmed by you automatically fails its saving throw against the Command you cast with this feature",
			"Once used, can't use again until after a long rest"
		]
	},
	"unbreakableMajesty": {
		"level": 14,
		"description": "Your appearance permanently gains an otherworldly aspect that makes you look more lovely and fierce. As a bonus action, you can assume a magically majestic presence for 1 minute or until you are incapacitated. For the duration, whenever any creature tries to attack you for the first time on a turn, the attacker must make a Charisma saving throw against your spell save DC. On a failed save, it can't attack you on this turn, and it must choose a new target for its attack or the attack is wasted. On a successful save, it can attack you on this turn, but it has disadvantage on any saving throw it makes against your spells on your next turn.",
		"additionalDetails": [
			"Once used, can't use again until after a short or long rest"
		]
	}
}
