[
	{
		"id": "Proficiencies",
		"name": "Proficiencies",
		"level": 1,
		"armor": ["Light armor"],
		"weapons": [
			"Simple weapons",
			"Hand crossbows",
			"Longswords",
			"Rapiers",
			"Shortswords"
		],
		"tools": ["Thieves' tools"],
		"saving_throws": ["Dexterity", "Intelligence"],
		"skills": "Choose four from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth"
	},
	{
		"id": "Equipment",
		"name": "Equipment",
		"level": 1,
		"description": "You start with the following equipment, in addition to the equipment granted by your background:",
		"starting_items": [
			"(a) a rapier or (b) a shortsword",
			"(a) a shortbow and quiver of 20 arrows or (b) a shortsword",
			"(a) a burglar's pack, (b) dungeoneer's pack, or (c) an explorer's pack",
			"Leather armor, two daggers, and thieves' tools"
		]
	},
	{
		"id": "Expertise",
		"name": "Expertise",
		"level": 1,
		"description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n\nAt 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit.",
		"mechanics": {
			"choices": {
				"level_1": "Two skill proficiencies OR one skill proficiency and thieves' tools",
				"level_6": "Two additional proficiencies (skills or thieves' tools)"
			},
			"effect": "Double proficiency bonus for chosen proficiencies"
		}
	},
	{
		"id": "Sneak Attack",
		"name": "Sneak Attack",
		"level": 1,
		"description": "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.\n\nYou don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.\n\nThe amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
		"mechanics": {
			"frequency": "Once per turn",
			"damage": {
				"dice": "1d6",
				"scaling": "Increases with level"
			},
			"requirements": {
				"weapon": ["Finesse weapon", "Ranged weapon"],
				"conditions": [
					"Advantage on attack roll",
					"OR enemy of target within 5 feet (not incapacitated) and no disadvantage"
				]
			}
		}
	},
	{
		"id": "Thieves Cant",
		"name": "Thieves' Cant",
		"level": 1,
		"description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.\n\nIn addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run.",
		"mechanics": {
			"communication": {
				"type": "Secret language and symbols",
				"time": "4x normal speaking time",
				"comprehension": "Only understood by others who know thieves' cant"
			}
		}
	},
	{
		"id": "Cunning Action",
		"name": "Cunning Action",
		"level": 2,
		"description": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action.",
		"mechanics": {
			"action": "bonus action",
			"options": ["Dash", "Disengage", "Hide"]
		}
	},
	{
		"id": "Roguish Archetype",
		"name": "Roguish Archetype",
		"level": 3,
		"description": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level.",
		"archetypes": [
			"Arcane Trickster",
			"Assassin",
			"Inquisitive",
			"Mastermind",
			"Phantom",
			"Scout",
			"Soulknife",
			"Swashbuckler",
			"Thief"
		]
	},
	{
		"id": "Uncanny Dodge",
		"name": "Uncanny Dodge",
		"level": 5,
		"description": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
		"mechanics": {
			"action": "reaction",
			"trigger": "Hit by attack from visible attacker",
			"effect": "Halve damage"
		}
	},
	{
		"id": "Evasion",
		"name": "Evasion",
		"level": 7,
		"description": "Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an Ice Storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
		"mechanics": {
			"trigger": "Dexterity saving throw for half damage",
			"effect": {
				"success": "No damage",
				"failure": "Half damage"
			}
		}
	},
	{
		"id": "Reliable Talent",
		"name": "Reliable Talent",
		"level": 11,
		"description": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.",
		"mechanics": {
			"trigger": "Ability check with proficiency",
			"effect": "Minimum roll of 10"
		}
	},
	{
		"id": "Blindsense",
		"name": "Blindsense",
		"level": 14,
		"description": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you.",
		"mechanics": {
			"range": "10 feet",
			"requirement": "Must be able to hear",
			"effect": "Detect hidden/invisible creatures"
		}
	},
	{
		"id": "Slippery Mind",
		"name": "Slippery Mind",
		"level": 15,
		"description": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws.",
		"mechanics": {
			"effect": "Gain Wisdom saving throw proficiency"
		}
	},
	{
		"id": "Elusive",
		"name": "Elusive",
		"level": 18,
		"description": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated.",
		"mechanics": {
			"effect": "Immune to advantage on attack rolls against you",
			"condition": "Not incapacitated"
		}
	},
	{
		"id": "Stroke of Luck",
		"name": "Stroke of Luck",
		"level": 20,
		"description": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.",
		"mechanics": {
			"options": [
				"Turn missed attack into hit",
				"Treat failed ability check as natural 20"
			],
			"uses": "Once per short or long rest"
		}
	}
]
