[
	{
		"id": "Proficiencies",
		"name": "Proficiencies",
		"level": 1,
		"armor": ["Light armor", "Medium armor", "Shields"],
		"armor_note": "Druids will not wear armor or use shields made of metal",
		"weapons": [
			"Clubs",
			"Daggers",
			"Darts",
			"Javelins",
			"Maces",
			"Quarterstaffs",
			"Scimitars",
			"Sickles",
			"Slings",
			"Spears"
		],
		"tools": ["Herbalism kit"],
		"saving_throws": ["Intelligence", "Wisdom"],
		"skills": "Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival"
	},
	{
		"id": "Equipment",
		"name": "Equipment",
		"level": 1,
		"description": "You start with the following equipment, in addition to the equipment granted by your background:",
		"starting_items": [
			"(a) a wooden shield or (b) any simple weapon",
			"(a) a scimitar or (b) any simple melee weapon",
			"Leather armor, an explorer's pack, and a druidic focus"
		]
	},
	{
		"id": "Druidic",
		"name": "Druidic",
		"level": 1,
		"description": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic.",
		"mechanics": {
			"message_detection": {
				"druids": "Automatically spot hidden messages",
				"others": {
					"spotting": "DC 15 Wisdom (Perception) check to notice presence",
					"deciphering": "Requires magic to understand"
				}
			}
		}
	},
	{
		"id": "Spellcasting",
		"name": "Spellcasting",
		"level": 1,
		"description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.\n\nCantrips\nAt 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.\n\nPreparing and Casting Spells\nThe Druid table shows how many spell slots you have to cast your druid spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your Druid level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell Cure Wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\nSpellcasting Ability\nWisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.\n\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\n\nSpell attack modifier = your proficiency bonus + your Wisdom modifier\n\nRitual Casting\nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\nSpellcasting Focus\nYou can use a druidic focus as a spellcasting focus for your druid spells.",
		"mechanics": {
			"spellcasting_ability": "Wisdom",
			"spell_save_dc": "8 + proficiency bonus + Wisdom modifier",
			"spell_attack": "proficiency bonus + Wisdom modifier",
			"ritual_casting": "Can cast prepared druid spells with ritual tag as rituals",
			"focus": "Can use a druidic focus as spellcasting focus",
			"spell_preparation": {
				"spells_prepared": "Wisdom modifier + Druid level (minimum 1)",
				"preparation_time": "1 minute per spell level",
				"when": "After a long rest"
			}
		}
	},
	{
		"id": "Wild Shape",
		"name": "Wild Shape",
		"level": 2,
		"description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\n\nBeast Shapes\nLevel   Max. CR   Limitations   Example\n2nd     1/4       No flying or swimming speed   Wolf\n4th     1/2       No flying speed   Crocodile\n8th     1         None   Giant eagle\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nWhile you are transformed, the following rules apply:\n\n- Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n\n- When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form, For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n\n- You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as Call Lightning, that you've already cast.\n\n- You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\n\n- You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",
		"mechanics": {
			"uses": "Twice per short or long rest",
			"action": "action to transform, bonus action to revert",
			"duration": "Hours equal to half druid level (rounded down)",
			"beast_shapes": {
				"2": {
					"max_cr": "1/4",
					"restrictions": "No flying or swimming speed"
				},
				"4": {
					"max_cr": "1/2",
					"restrictions": "No flying speed"
				},
				"8": {
					"max_cr": "1",
					"restrictions": "None"
				}
			}
		}
	},
	{
		"id": "Druid Circle",
		"name": "Druid Circle",
		"level": 2,
		"description": "At 2nd level, you choose to identify with a circle of druids. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
		"circles": [
			"Dreams",
			"Land",
			"Moon",
			"Shepherd",
			"Spores",
			"Stars",
			"Wildfire"
		]
	},
	{
		"id": "Timeless Body",
		"name": "Timeless Body",
		"level": 18,
		"description": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
	},
	{
		"id": "Beast Spells",
		"name": "Beast Spells",
		"level": 18,
		"description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."
	},
	{
		"id": "Archdruid",
		"name": "Archdruid",
		"level": 20,
		"description": "At 20th level, you can use your Wild Shape an unlimited number of times.\n\nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
	}
]
